package additionalTasks.lesson5.Task3;

public class Main {
	//-- Задача 3 --
//Написать класс Автомобиль с вложенным классом ПримерДвижения
//Написать класс Велосипед с вложенным классом ПримерДвижения
//Написать класс Улитка с вложенным классом ПримерДвижения
//
//Принимаем за условие, что все объекты классов Автомобиль, Велосипед и Улитка будут двигаться с соответветствующими звуками "Врум-Врум", "Шарк-Шарк", "шлеп"
//
//Соответственно у вложенных классов ПримерДвижения, должен быть метод выводящий на консоль пример движения Автомобиля, Велосипеда и Улитки

}

